#ifndef BT_FLAGS_H
#define BT_FLAGS_H

typedef struct {
  struct {
/* 0x00 */  u8 tutorial_honeycombs : 1;
            u8 tutorial_treble_clefs : 1;
            u8 tutorial_gold_feathers : 1;
            u8 tutorial_red_feathers : 1;
            u8 tutorial_eggs : 1;
            u8 tutorial_glowbos : 1;
            u8 tutorial_notes : 1;
            u8 _unknown_0x00_0 : 1;
/* 0x01 */  u8 _unknown_0x01_7 : 1;
            u8 _unknown_0x01_6 : 1;
            u8 tutorial_jinjos : 1;
            u8 _unknown_0x01_4 : 1;
            u8 sm_opened_pink_egg_area : 1;
            u8 tutorial_honeycomb_pieces : 1;
            u8 encountered_first_skill_stop_honeycomb : 1;
            u8 encountered_first_random_stop_honeycomb : 1;
/* 0x02 */  u8 gi_floor3_opened_elevator : 1;
            u8 gi_floor2_opened_elevator : 1;
            u8 gi_floor1_opened_quarters_painting : 1;
            u8 sm_klungo_cutscene : 1;
            u8 cutscene_revived_jingaling_and_bottles : 1; // controls bottles house party mode?
            u8 tutorial_signposts : 1;
            u8 intro_terry_no_hatch : 1;
            u8 _unknown_0x02_0 : 1;
/* 0x03 */  u8 hfp_lava_stadium_opened_eggs : 1;
            u8 hfp_lava_stadium_opened_claw_clamber_boots : 1;
            u8 jrl_opened_jinjo_chest : 1;
            u8 intro_hag1 : 1;
            u8 ck_defeated_hag1 : 1;
            u8 cheats_nestking_unlocked : 1;
            u8 _unknown_0x03_1 : 1;
            u8 gi_floor4_opened_elevator : 1;
/* 0x04 */  u8 tutorial_claw_clamber_boots : 1;
            u8 tutorial_springy_step_shoes : 1;
            u8 intro_bovina : 1;
            u8 cheats_jiggywiggyspecial_enabled : 1;
            u8 cheats_jiggywiggyspecial_unlocked : 1;
            u8 ww_traded_big_top_tickets : 1;
            u8 hfp_lava_opened_flight_pad : 1;
            u8 hfp_lava_stadium_opened_mt : 1;
/* 0x05 */  u8 intro_minjos : 1;
            u8 collected_mega_glowbo : 1;
            u8 intro_humba_pine_grove : 1;
            u8 _unknown_0x05_4 : 1;
            u8 _unknown_0x05_3 : 1;
            u8 _unknown_0x05_2 : 1;
            u8 tutorial_mt_goliath_timeout : 1;
            u8 tutorial_mt_goliath : 1;
/* 0x06 */  u8 mt_opened_kickball_door3 : 1;
            u8 mt_opened_kickball_door2 : 1;
            u8 tdl_rocknuts_defeated : 1;
            u8 mt_dilberta_left : 1;
            u8 intro_dilberta : 1;
            u8 mt_priceless_relic_thingy_returned : 1;
            u8 intro_unogopaz_as_stony : 1;
            u8 intro_unogopaz : 1;
/* 0x07 */  u8 tutorial_pages : 1;
            u8 ggm_cutscene_canary_mary_left_cage : 1;
            u8 _unknown_0x07_5 : 1;
            u8 intro_mt_kickball_welcome : 1;
            u8 _unknown_0x07_3 : 1;
            u8 _unknown_0x07_2 : 1;
            u8 _unknown_0x07_1 : 1;
            u8 _unknown_0x07_0 : 1;
/* 0x08 */  u8 cheats_honeyback_received : 1;
            u8 cheats_fallproof_received : 1;
            u8 cheats_eggs_received : 1;
            u8 cheats_feathers_received : 1;
            u8 tutorial_code_chamber_typing : 1;
            u8 tutorial_code_chamber_podium : 1;
            u8 tutorial_cheat_codes : 1;
            u8 intro_cheato : 1;
/* 0x09 */  u8 cheats_getjiggy_unlocked : 1;
            u8 cheats_getjiggy_received : 1;
            u8 cheats_jukebox_unlocked : 1;
            u8 cheats_honeyback_unlocked : 1;
            u8 cheats_fallproof_unlocked : 1;
            u8 cheats_eggs_unlocked : 1;
            u8 cheats_feathers_unlocked : 1;
            u8 cheats_jukebox_received : 1;
/* 0x0A */  u8 _unknown_0x0A_7 : 1;
            u8 ggm_opened_canary_cave : 1;
            u8 intro_mumbo : 1;
            u8 _unknown_0x0A_4 : 1;
            u8 _unknown_0x0A_3 : 1;
            u8 cheats_honeyking_unlocked : 1;
            u8 cheats_superbaddy_unlocked : 1;
            u8 cheats_superbanjo_unlocked : 1;
/* 0x0B */  u8 intro_gobi : 1; // gets unset when freed
            u8 ggm_defeated_chuffy : 1;
            u8 ggm_opened_jinjo_gloomy_caverns : 1;
            u8 ggm_opened_flooded_caves : 1;
            u8 ggm_dilberta_arrived : 1;
            u8 intro_bullion_bill : 1;
            u8 _unknown_0x0B_1 : 1;
            u8 ggm_opened_fuel_depot_path : 1;
/* 0x0C */  u8 intro_humba : 1;
            u8 ww_returned_groggy : 1;
            u8 ww_returned_soggy : 1;
            u8 ww_returned_moggy : 1;
            u8 intro_mrs_boggy : 1; // unset after returning all 3 kids
            u8 tdl_returned_missing_dino : 1;
            u8 intro_ww_dino : 1;
            u8 intro_targitzan : 1;
/* 0x0D */  u8 ww_opened_cave_of_horrors_gobi : 1;
            u8 ww_opened_train : 1;
            u8 ggm_mumbo_train : 1; // "derailed" status, similar to other worlds' station buttons
            u8 ww_opened_saucer_of_peril : 1;
            u8 ww_cutscene_ufo_moved : 1;
            u8 intro_ufo2 : 1;
            u8 ggm_cutscene_ufo_moved : 1;
            u8 intro_ufo : 1;
/* 0x0E */  u8 ww_opened_burgers : 1;
            u8 intro_ww_fries : 1;
            u8 intro_ww_burgers : 1;
            u8 ww_defeated_mr_patch : 1;
            u8 tutorial_mumbo_pad_as_mumbo : 1;
            u8 tutorial_mumbo_pad : 1;
            u8 ww_opened_cave_of_horrors_jinjo : 1;
            u8 ww_opened_cave_of_horrors_dino : 1;
/* 0x0F */  u8 ww_opened_electric_fence : 1;
            u8 _unknown_0x0F_6 : 1;
            u8 ww_paid_dodgem : 1;
            u8 ww_opened_inferno : 1;
            u8 _unknown_0x0F_3 : 1;
            u8 ioh_quagmire_opened_ck_shock_jump : 1;
            u8 intro_conga : 1;
            u8 ww_opened_fries : 1;
/* 0x10 */  u8 _unknown_0x10_7 : 1;
            u8 _unknown_0x10_6 : 1;
            u8 ww_opened_dodgem3 : 1;
            u8 ww_opened_dodgem2 : 1;
            u8 ww_opened_dodgem1 : 1;
            u8 ww_won_dodgem2 : 1;
            u8 ww_won_dodgem1 : 1;
            u8 _unknown_0x10_0 : 1;
/* 0x11 */  u8 intro_klungo3 : 1;
            u8 jrl_saved_aliens : 1;
            u8 jrl_opened_pawno_page : 1;
            u8 jrl_opened_pawno_jiggy : 1;
            u8 ww_opened_space_ggm : 1;
            u8 ww_opened_western_crazy_castle : 1;
            u8 mt_opened_jade_snake_area : 1;
            u8 ww_won_dodgem3 : 1;
/* 0x12 */  u8 ww_cutscene_cable_car_ride : 1;
            u8 jrl_untipped_turtle : 1;
            u8 jrl_hatched_turtle : 1;
            u8 intro_tiptup : 1;
            u8 ww_fed_groggy : 1;
            u8 intro_groggy : 1; // unset after returning all 3 kids
            u8 intro_soggy : 1; // unset after returning all 3 kids
            u8 intro_moggy : 1; // unset after returning all 3 kids
/* 0x13 */  u8 tdl_opened_stomponadon_hfp : 1; // banjo
            u8 tdl_opened_stomponadon_jinjo : 1; // kazooie
            u8 intro_stomponadon : 1;
            u8 intro_merry_maggie : 1;
            u8 intro_jolly : 1; // unset when saving merry maggie
            u8 jrl_paid_jolly : 1;
            u8 intro_klungo1 : 1;
            u8 jrl_saved_merry_maggie : 1; // when set, unsets intro_jolly
/* 0x14 */  u8 jrl_opened_splitup_entrance : 1;
            u8 jrl_opened_ancient_swimming_baths : 1;
            u8 jrl_opened_pig_pool_pipe : 1;
            u8 jrl_opened_smugglers_cavern_gi : 1;
            u8 jrl_opened_sunken_ship_ggm : 1;
            u8 _unknown_0x14_2 : 1;
            u8 mt_opened_prison_compound_area : 1;
            u8 tdl_opened_stomponadon_jiggy : 1; // banjo & kazooie
/* 0x15 */  u8 ggm_humba : 1;
            u8 mt_humba : 1;
            u8 mt_opened_prison_door : 1;
            u8 ww_opened_cable_car_ride : 1;
            u8 intro_code_chamber_plaque : 1; // auto opens menu on approach if 0
            u8 jrl_unknown2 : 2;
            u8 jrl_unknown1 : 1; // set when entering atlantis. if 0, randomizes jrl_unknown2
/* 0x16 */  u8 intro_blubber : 1;
            u8 humba_dragon_kazooie : 1;
            u8 ccl_humba : 1;
            u8 hfp_humba : 1;
            u8 gi_humba : 1;
            u8 tdl_humba : 1;
            u8 jrl_humba : 1;
            u8 ww_humba : 1;
/* 0x17 */  u8 intro_bargasaurus : 1;
            u8 _unknown_0x17_6 : 1;
            u8 tdl_defeated_terry : 1;
            u8 intro_captain_blackeye : 1;
            u8 mt_opened_treasure_chamber_tdl : 1;
            u8 tutorial_humba_first_transform : 1; // jump back in to revert to bk
            u8 _unknown_0x17_1 : 1;
            u8 jrl_paid_blubber : 1;
/* 0x18 */  u8 beak_buster_attack : 1;
            u8 beak_bomb_attack : 1;
            u8 beak_barge_attack : 1;
            u8 ww_mumbo_dodgem_dome : 1;
            u8 ww_mumbo_saucer_of_peril : 1;
            u8 ww_mumbo_star_spinner : 1;
            u8 jrl_mumbo_oxygenate : 1;
            u8 tutorial_clockwork_kazooie_eggs : 1;
/* 0x19 */  u8 basic_jumping : 1; // hangs game when not set if asked about in spiral mountain
            u8 flight : 1;
            u8 flap_flip : 1;
            u8 feathery_flap : 1;
            u8 egg_firing : 1;
            u8 climbing : 1; // hangs game when not set if asked about in spiral mountain
            u8 basic_peck_attack : 1;
            u8 _unknown_0x19_0 : 1; // set on new save
/* 0x1A */  u8 wonder_wing : 1;
            u8 turbo_trainers : 1;
            u8 talon_trot : 1;
            u8 diving : 1;
            u8 wading_boots : 1;
            u8 shock_jump : 1; // requires basic_jumping | hangs game when not set if asked about in spiral mountain
            u8 rolling_attack : 1;
            u8 airborne_peck_attack : 1;
/* 0x1B */  u8 beak_bayonet : 1;
            u8 bill_drill : 1;
            u8 tutorial_change_egg_type : 1;
            u8 _unknown_0x1B_4 : 1;
            u8 egg_aim : 1;
            u8 breegull_blaster : 1;
            u8 grip_grab : 1;
            u8 _unknown_0x1B_0 : 1; // set on new save
/* 0x1C */  u8 glide : 1;
            u8 shack_pack : 1;
            u8 trex_roar : 1;
            u8 sub_aqua_egg_aiming : 1;
            u8 talon_torpedo : 1;
            u8 wing_whack : 1;
            u8 split_up : 1;
            u8 airborne_egg_aiming : 1;
/* 0x1D */  u8 sack_pack : 1;
            u8 pack_whack : 1;
            u8 hatch : 1;
            u8 taxi_pack : 1;
            u8 springy_step_shoes : 1;
            u8 claw_clamber_boots : 1;
            u8 leg_spring : 1;
            u8 snooze_pack : 1;
/* 0x1E */  u8 breegull_bash : 1;
            u8 blue_eggs : 1; // game hangs when egg nests try to switch to a different egg type, but player has no egg types
            u8 fast_swimming : 1;
            u8 ice_eggs : 1;
            u8 clockwork_kazooie_eggs : 1;
            u8 grenade_eggs : 1;
            u8 fire_eggs : 1;
            u8 amaze_o_gaze : 1;
/* 0x1F */  u8 _unknown_0x1F_7 : 1;
            u8 _unknown_0x1F_6 : 1;
            u8 _unknown_0x1F_5 : 1;
            u8 _unknown_0x1F_4 : 1;
            u8 _unknown_0x1F_3 : 1;
            u8 _unknown_0x1F_2 : 1;
            u8 _unknown_0x1F_1 : 1;
            u8 _unknown_0x1F_0 : 1;
/* 0x20 */  u8 _unknown_0x20_7 : 1;
            u8 _unknown_0x20_6 : 1;
            u8 _unknown_0x20_5 : 1;
            u8 _unknown_0x20_4 : 1;
            u8 _unknown_0x20_3 : 1;
            u8 _unknown_0x20_2 : 1;
            u8 _unknown_0x20_1 : 1;
            u8 _unknown_0x20_0 : 1;
/* 0x21 */  u8 _unknown_0x21_7 : 1;
            u8 _unknown_0x21_6 : 1;
            u8 _unknown_0x21_5 : 1;
            u8 _unknown_0x21_4 : 1;
            u8 _unknown_0x21_3 : 1;
            u8 _unknown_0x21_2 : 1;
            u8 _unknown_0x21_1 : 1;
            u8 _unknown_0x21_0 : 1;
/* 0x22 */  u8 jrl_doubloon_collected_bollards1 : 1;
            u8 _unknown_0x22_6 : 1;
            u8 _unknown_0x22_5 : 1;
            u8 _unknown_0x22_4 : 1;
            u8 _unknown_0x22_3 : 1;
            u8 _unknown_0x22_2 : 1;
            u8 _unknown_0x22_1 : 1;
            u8 _unknown_0x22_0 : 1;
/* 0x23 */  u8 jrl_doubloon_collected_wing_whack1 : 1;
            u8 jrl_doubloon_collected_wing_whack2 : 1;
            u8 jrl_doubloon_collected_wing_whack3 : 1;
            u8 jrl_doubloon_collected_bollards2 : 1;
            u8 jrl_doubloon_collected_bollards3 : 1;
            u8 jrl_doubloon_collected_bollards4 : 1;
            u8 jrl_doubloon_collected_bollards5 : 1;
            u8 jrl_doubloon_collected_bollards6 : 1;
/* 0x24 */  u8 jrl_doubloon_collected_mumbo1 : 1;
            u8 jrl_doubloon_collected_mumbo2 : 1;
            u8 jrl_doubloon_collected_mumbo3 : 1;
            u8 jrl_doubloon_collected_pig_pool1 : 1;
            u8 jrl_doubloon_collected_pig_pool2 : 1;
            u8 jrl_doubloon_collected_pig_pool3 : 1;
            u8 jrl_doubloon_collected_pig_pool4 : 1;
            u8 jrl_doubloon_collected_wing_whack4 : 1;
/* 0x25 */  u8 jrl_doubloon_collected_captain_blackeye1 : 1; // also controls whether captain blackeye is in the chair or on the ground
            u8 jrl_doubloon_collected_shock_jump_alcove1 : 1;
            u8 jrl_doubloon_collected_shock_jump_alcove2 : 1;
            u8 jrl_doubloon_collected_shock_jump_alcove3 : 1;
            u8 jrl_doubloon_collected_buried_spot_jollys : 1;
            u8 jrl_doubloon_collected_buried_spot_pawnos : 1;
            u8 jrl_doubloon_collected_buried_spot_entrance : 1;
            u8 jrl_doubloon_collected_mumbo4 : 1;
/* 0x26 */  u8 tdl_enlarged_small_dino : 1;
            u8 tdl_healed_sick_dino : 1;
            u8 intro_scrotty : 1; // scrat, sick. scrit, small. scrut, missing.
            u8 jrl_doubloon_collected_underwater1 : 1;
            u8 jrl_doubloon_collected_underwater2 : 1;
            u8 jrl_doubloon_collected_underwater3 : 1;
            u8 jrl_doubloon_collected_underwater4 : 1;
            u8 jrl_doubloon_collected_captain_blackeye2 : 1;
/* 0x27 */  u8 jrl_pig_pool_warmed : 1;
            u8 jrl_pig_pool_toxic_waste_off : 1;
            u8 tutorial_doubloons : 1;
            u8 tdl_opened_train : 1;
            u8 gi_outside_opened_train : 1;
            u8 ww_opened_western_pump_room : 1;
            u8 _unknown_0x27_1 : 1;
            u8 tdl_enlarged_stepping_stones : 1;
/* 0x28 */  u8 intro_oogle_boogle : 1;
            u8 tdl_oogle_boogle_food_main : 1;
            u8 tdl_oogle_boogle_food_back : 1;
            u8 tdl_oogle_boogle_food_upper : 1;
            u8 gi_floor4_opened_flight_pad : 1;
            u8 tdl_opened_oogle_boogle_ww : 1;
            u8 intro_loggo : 1;
            u8 intro_piggles : 1; // unset when completing both quest parts
/* 0x29 */  u8 tdl_hatched_inside_the_mountain : 1;
            u8 tdl_hatched_unga_bunga : 1;
            u8 tdl_hatched_oogle_boogle : 1;
            u8 intro_weldar : 1;
            u8 tdl_opened_below_terry_nest : 1;
            u8 intro_terry : 1;
            u8 train_cooled : 1;
            u8 intro_terry_path_to_nest : 1;
/* 0x2A */  union {
              /*
                if tdl_rocknuts_defeated: tdl_rocknuts_last_defeated holds location of the last defeated rocknut, where jiggy will be
                else: tdl_defeated_rocknuts holds which rocknuts have been defeated
                tdl_rocknuts_last_defeated values to locations:
                  0 - train station
                  1 - caged near jinjo
                  2 - caged upper lake
                  3 - entrance
                  4 - near roar cage
              */
              struct {
                u8 _unused1 : 1;
                u8 near_roar_cage : 1;
                u8 near_entrance : 1;
                u8 caged_upper_lake : 1;
                u8 caged_near_jinjo : 1;
                u8 train_station : 1;
                u8 _unused2 : 2;
              } tdl_defeated_rocknuts;
              struct {
                u8 intro_mr_patch : 1;
                u8 tdl_rocknuts_last_defeated : 5;
                u8 intro_chuffy : 1;
                u8 tdl_hatched_lower_lake : 1;
              };
            }; // combined due to tdl_rocknuts
/* 0x2B */  u8 tdl_opened_bridge_inside_the_mountain : 1;
            u8 tdl_opened_oogle_boogle_cave : 1;
            u8 tdl_opened_unga_bunga_back_entrance : 1;
            u8 tdl_opened_unga_bunga_entrance : 1;
            u8 tdl_opened_top_inside_the_mountain : 1;
            u8 mt_opened_kickball_hfp : 1;
            u8 gi_floor1_opened_bathroom : 1;
            u8 tdl_opened_jinjo_lower_lake : 1;
/* 0x2C */  u8 _unknown_0x2C_7 : 1;
            u8 gi_floor1_raised_toxic_waste : 1;
            u8 jrl_opened_temple_of_fishes : 1;
            u8 gi_defeated_weldar : 1;
            u8 mt_opened_treasure_chamber : 1;
            u8 tdl_enlarged_wigwam : 1;
            u8 tdl_sick_dino_on_train : 1;
            u8 gi_floor1_pressed_fire_exit_button : 1; // not tied to door
/* 0x2D */  u8 gi_roof_opened_window_edge : 1;
            u8 gi_roof_opened_chimney : 1;
            u8 _unknown_0x2D_5 : 1;
            u8 _unknown_0x2D_4 : 1;
            u8 _unknown_0x2D_3 : 1;
            u8 _unknown_0x2D_2 : 1;
            u8 _unknown_0x2D_1 : 1;
            u8 _unknown_0x2D_0 : 1;
/* 0x2E */  u8 tutorial_ww_big_top_ticket : 1;
            u8 gi_floor2_mumbo_electromagnet_fixed : 1; // set when timeout, unused?
            u8 gi_outside_cutscene_jinjo_close : 1;
            u8 gi_outside_cutscene_jinjo_open : 1;
            u8 gi_outside_opened_window_floor1 : 1;
            u8 gi_outside_opened_window_floor2_page : 1;
            u8 gi_outside_opened_window_floor2_screws : 1;
            u8 gi_roof_opened_window_center : 1;
/* 0x2F */  u8 intro_mrs_bottles : 1;
            u8 intro_terry_past_path_to_nest : 1;
            u8 jingaling_cutscene : 1; // also controls bottles house->wooded hollow door. unset after revival cutscene
            u8 _unknown_0x2F_4 : 1;
            u8 _unknown_0x2F_3 : 1;
            u8 _unknown_0x2F_2 : 1;
            u8 _unknown_0x2F_1 : 1;
            u8 gi_floor1_cutscene_trash_compactor : 1;
/* 0x30 */  u8 intro_lord_woo_fak_fak : 1;
            u8 intro_ww_baloon_burst : 1;
            u8 intro_ww_hoop_hurry : 1;
            u8 intro_dingpot : 1;
            u8 gi_floor1_opened_main_entrance : 1;
            u8 _unknown_0x30_2 : 1;
            u8 intro_goggles : 1;
            u8 intro_speccy : 1;
/* 0x31 */  u8 gi_floor2_used_battery_toxic_room : 1;
            u8 gi_floor2_used_battery_room_with_worker_rabbit : 1;
            u8 gi_floor3_used_battery : 1;
            u8 gi_outside_used_battery : 1;
            u8 gi_floor4_opened_cable_room : 1;
            u8 gi_floor3_opened_packing_room : 1;
            u8 gi_floor2_opened_electromagnet_chamber : 1;
            u8 gi_floor1_opened_waste_disposal_plant : 1;
/* 0x32 */  u8 extra_bubbles : 1; // also controls if fish is in moat or not
            u8 gi_floor4_cutscene_quality_control_toxic : 1;
            u8 gi_floor4_quality_control_toxic : 1;
            u8 gi_floor4_cutscene_quality_control_cleaned : 1;
            u8 gi_floor1_defeated_tintops : 1;
            u8 intro_klungo2 : 1;
            u8 tdl_cutscene_chompasaurus : 1;
            u8 gi_floor1_opened_weldar : 1;
/* 0x33 */  u8 intro_hfp_icy_big_foot : 1; // must be set before he can be hit
            u8 hfp_lava_cutscene_gobi : 1;
            u8 intro_mildred : 1;
            u8 gi_floor3_opened_mumbo_pad_electromagnet_chamber : 1;
            u8 gi_floor5_opened_path_floor4 : 1;
            u8 gi_floor2_opened_floor1_washer_path : 1;
            u8 gi_floor2_opened_duct_toxic_room : 1;
            u8 gi_floor2_opened_duct_near_humba : 1;
/* 0x34 */  u8 hfp_icy_opened_train : 1;
            u8 intro_trotty : 1; // unset when completing both quest parts
            u8 ww_boggy_returned_kids : 1;
            u8 hfp_icy_opened_claw_clamber_boots : 1;
            u8 hfp_sabreman : 2; // 0 = frozen, 1 = unfrozen, 2 = warmed, 3 = returned to tent
            u8 intro_george : 1;
            u8 intro_gi_floor3_packing_room : 1;
/* 0x35 */  u8 _unknown_0x35_7 : 1;
            u8 hfp_lava_defeated_chilli_billi : 1;
            u8 hfp_icy_defeated_chilly_willy : 1;
            u8 intro_chilli_billi : 1;
            u8 intro_chilly_willy : 1;
            u8 hfp_defeated_chilly_willy_last : 1; // set when defeating second dragon. if 0, jiggy will be at chilli billi, otherwise at chilly willy
            u8 tutorial_humba_first_untransform : 1; // next time is free
            u8 hfp_lava_opened_train : 1;
/* 0x36 */  u8 ccl_seed1 : 3; // affects buried spot positions. ccl_seed = (ccl_seed1 << 1) | ccl_seed2
            u8 ccl_randomized_seed : 1; // if 0, randomizes ccl_seed and gets set to 1
            u8 ccl_activated_pot_o_gold : 1;
            u8 sm_fish_collected : 1; // set after breaking boulder, not when collecting fish
            u8 gi_floor2_opened_duct_near_worker : 1;
            u8 _unknown_0x36_0 : 1;
/* 0x37 */  u8 tdl_visited : 1;
            u8 jrl_visited : 1;
            u8 ww_visited : 1;
            u8 ggm_visited : 1;
            u8 mt_visited : 1;
            u8 ccl_played_pot_o_gold : 1;
            u8 ccl_mumbo_rain_dance_finished : 1;
            u8 ccl_seed2 : 1;
/* 0x38 */  u8 hfp_icy_icicle_grotto_spikes3 : 1;
            u8 hfp_icy_icicle_grotto_spikes2 : 1;
            u8 hfp_icy_icicle_grotto_spikes1 : 1;
            u8 ioh_visited : 1;
            u8 ck_visited : 1;
            u8 ccl_visited : 1;
            u8 hfp_visited : 1;
            u8 gi_visited : 1;
/* 0x39 */  u8 mt_jinjo_underwater : 1;
            u8 mt_jinjo_temple : 1;
            u8 mt_jinjo_kickball : 1;
            u8 mt_jinjo_grip_grab : 1;
            u8 hfp_icy_icicle_grotto_spikes7 : 1;
            u8 hfp_icy_icicle_grotto_spikes6 : 1;
            u8 hfp_icy_icicle_grotto_spikes5 : 1;
            u8 hfp_icy_icicle_grotto_spikes4 : 1;
/* 0x3A */  u8 ww_jinjo_cave_of_horrors : 1;
            u8 ww_jinjo_big_top : 1;
            u8 ggm_jinjo_tracks : 1;
            u8 ggm_jinjo_near_train_station : 1;
            u8 ggm_jinjo_toxic_gas_cave : 1;
            u8 ggm_jinjo_gloomy_caverns : 1;
            u8 ggm_jinjo_water_storage : 1;
            u8 mt_jinjo_bridge : 1;
/* 0x3B */  u8 jrl_jinjo_collected_chest : 1;
            u8 jrl_jinjo_seaweed_sanctum : 1;
            u8 jrl_jinjo_big_fish : 1;
            u8 jrl_jinjo_blubbers : 1;
            u8 jrl_jinjo_alcove_across_town : 1;
            u8 ww_jinjo_western : 1;
            u8 ww_jinjo_space : 1;
            u8 ww_jinjo_entrance : 1;
/* 0x3C */  u8 gi_jinjo_waste_disposal_plant_jrl : 1;
            u8 gi_floor2_jinjo_toxic_room : 1;
            u8 gi_roof_jinjo_center_window : 1;
            u8 tdl_jinjo_stomponadon : 1;
            u8 tdl_jinjo_caged_near_humba : 1;
            u8 tdl_jinjo_caged_near_rocknut : 1;
            u8 tdl_jinjo_caged_entrance : 1;
            u8 tdl_jinjo_lower_lake : 1;
/* 0x3D */  u8 ccl_jinjo_trashcan : 1;
            u8 hfp_icy_jinjo_mildred : 1;
            u8 hfp_icy_jinjo_icicle_grotto : 1;
            u8 hfp_icy_jinjo_wind_tunnel : 1;
            u8 hfp_lava_jinjo_hot_water : 1;
            u8 hfp_lava_jinjo_waterfall : 1;
            u8 gi_outside_jinjo : 1;
            u8 gi_floor3_jinjo_boiler_plant : 1;
/* 0x3E */  u8 ioh_jinjo_plateau : 1;
            u8 ioh_jinjo_cliff_top : 1;
            u8 ioh_jinjo_wasteland : 1;
            u8 ioh_jinjo_wooded_hollow : 1;
            u8 ccl_jinjo_humba : 1;
            u8 ccl_jinjo_mingy_jongo : 1;
            u8 ccl_jinjo_near_jamjars : 1;
            u8 ccl_jinjo_cheese : 1;
/* 0x3F */  u8 ggm_honeycomb_piece_train_station : 1;
            u8 ggm_honeycomb_piece_prospectors_hut : 1;
            u8 ggm_honeycomb_piece_toxic_gas_cave : 1;
            u8 mt_honeycomb_piece_treasure_chamber : 1;
            u8 mt_honeycomb_piece_bovina : 1;
            u8 mt_honeycomb_piece_entrance : 1;
            u8 jrl_jinjo_spawned_chest : 1; // if jrl_opened_jinjo_chest && !jrl_jinjo_collected_chest, sets/unsets on scene enter/exit
            u8 sm_jinjo_underwater : 1;
/* 0x40 */  u8 tdl_honeycomb_piece_scrotty : 1;
            u8 tdl_honeycomb_piece_lower_lake : 1;
            u8 jrl_honeycomb_piece_above_pig_pool : 1;
            u8 jrl_honeycomb_piece_atlantis : 1;
            u8 jrl_honeycomb_piece_seemee : 1;
            u8 ww_honeycomb_piece_western : 1;
            u8 ww_honeycomb_piece_mumbo : 1;
            u8 ww_honeycomb_piece_space : 1;
/* 0x41 */  u8 ccl_honeycomb_piece_collected_buried_item : 1;
            u8 hfp_lava_honeycomb_piece_hot_water : 1;
            u8 hfp_lava_honeycomb_piece_train_station : 1;
            u8 hfp_lava_honeycomb_piece_inside_volcano : 1;
            u8 gi_roof_honeycomb_piece_chimney : 1;
            u8 gi_floor1_honeycomb_piece_train_station : 1;
            u8 gi_floor2_honeycomb_piece_corner_box : 1;
            u8 tdl_honeycomb_piece_river_passage : 1;
/* 0x42 */  u8 mt_glowbo_mumbo : 1;
            u8 ggm_opened_toxic_gas_cave_boulder_honeycomb_piece : 1;
            u8 ggm_opened_honeycomb_piece_train_station : 1; // unsets on scene entry/exit if !ggm_opened_honeycomb_piece_train_station
            u8 ccl_honeycomb_piece_spawned_buried_item : 1;
            u8 jrl_honeycomb_piece_spawned_seemee : 1; // if !jrl_honeycomb_piece_spawned_seemee, sets/unsets as you enter/leave scene with seemee
            u8 ioh_honeycomb_piece_plateau : 1;
            u8 ccl_honeycomb_piece_pot_o_gold : 1;
            u8 ccl_honeycomb_piece_trash_can : 1;
/* 0x43 */  u8 tdl_glowbo_humba : 1;
            u8 jrl_glowbo_humba : 1;
            u8 jrl_glowbo_mumbo : 1;
            u8 ww_glowbo_humba : 1;
            u8 ww_glowbo_mumbo : 1;
            u8 ggm_glowbo_mumbo : 1;
            u8 ggm_glowbo_humba : 1;
            u8 mt_glowbo_humba : 1;
/* 0x44 */  u8 ioh_glowbo : 1;
            u8 ccl_glowbo_mumbo : 1;
            u8 ccl_glowbo_humba : 1;
            u8 hfp_icy_glowbo_humba : 1;
            u8 hfp_lava_glowbo_mumbo : 1;
            u8 gi_floor3_glowbo_mumbo : 1;
            u8 gi_floor2_glowbo_humba : 1;
            u8 tdl_glowbo_mumbo : 1;
/* 0x45 */  u8 mt_jiggy_collected_columns : 1;
            u8 mt_jiggy_collected_wading_boots : 1;
            u8 mt_jiggy_collected_goliath : 1;
            u8 mt_jiggy_collected_treasure_chamber : 1;
            u8 mt_jiggy_collected_bovina : 1;
            u8 mt_jiggy_collected_kickball : 1;
            u8 mt_jiggy_collected_slightly_sacred_chamber : 1;
            u8 mt_jiggy_collected_targitzan : 1;
/* 0x46 */  u8 ggm_jiggy_collected_dilberta : 1;
            u8 ggm_jiggy_collected_ordnance_storage : 1;
            u8 ggm_jiggy_collected_waterfall_cavern : 1;
            u8 ggm_jiggy_collected_generator_cavern : 1;
            u8 ggm_jiggy_collected_canary_mary : 1;
            u8 ggm_jiggy_collected_chuffy : 1;
            u8 mt_jiggy_collected_ssslumber : 1;
            u8 mt_jiggy_collected_temple_top : 1;
/* 0x47 */  u8 ww_jiggy_collected_saucer_of_peril : 1;
            u8 ww_jiggy_collected_mr_patch : 1;
            u8 ww_jiggy_collected_dodgem : 1;
            u8 ww_jiggy_collected_hoop_hurry : 1;
            u8 ggm_jiggy_collected_flooded_caves : 1;
            u8 ggm_jiggy_collected_power_hut_basement : 1;
            u8 ggm_jiggy_collected_behind_waterfall : 1;
            u8 ggm_jiggy_collected_crushing_shed : 1;
/* 0x48 */  u8 jrl_jiggy_collected_tiptup : 1;
            u8 jrl_jiggy_collected_sea_bottom_cavern : 1;
            u8 ww_jiggy_collected_test_of_strength : 1;
            u8 ww_jiggy_collected_inferno : 1;
            u8 ww_jiggy_collected_star_spinner : 1;
            u8 ww_jiggy_collected_mrs_boggy : 1;
            u8 ww_jiggy_collected_high_dive : 1;
            u8 ww_jiggy_collected_balloon_burst : 1;
/* 0x49 */  u8 jrl_jiggy_collected_aliens : 1;
            u8 jrl_jiggy_collected_pawno : 1;
            u8 jrl_jiggy_collected_seemee : 1;
            u8 jrl_jiggy_collected_lord_woo_fak_fak : 1;
            u8 jrl_jiggy_collected_jolly : 1;
            u8 jrl_jiggy_collected_smugglers_cavern : 1;
            u8 jrl_jiggy_collected_pig_pool : 1;
            u8 jrl_jiggy_collected_chris_p_bacon : 1;
/* 0x4A */  u8 tdl_jiggy_collected_stomponadon : 1;
            u8 tdl_jiggy_collected_terry_eggs : 1;
            u8 tdl_jiggy_collected_chompasaurus : 1;
            u8 tdl_jiggy_collected_oogle_boogle : 1;
            u8 tdl_jiggy_collected_terry_fight : 1;
            u8 tdl_jiggy_collected_scrotty : 1;
            u8 tdl_jiggy_collected_dippy : 1;
            u8 tdl_jiggy_collected_below_terry_nest : 1;
/* 0x4B */  u8 gi_floor4_jiggy_collected_quality_control : 1;
            u8 gi_roof_jiggy_collected_window_edge : 1;
            u8 gi_jiggy_collected_workers : 1;
            u8 gi_floor4_jiggy_collected_clinkers_cavern : 1;
            u8 gi_floor1_jiggy_collected_weldar : 1;
            u8 gi_floor1_jiggy_collected_toxic_waste_disposal_side_room : 1;
            u8 tdl_jiggy_collected_roar_cage : 1;
            u8 tdl_jiggy_collected_rocknuts : 1;
/* 0x4C */  u8 hfp_icy_jiggy_collected_boggy : 1;
            u8 hfp_lava_jiggy_collected_sabreman : 1;
            u8 hfp_lava_jiggy_collected_inside_volcano : 1;
            u8 hfp_jiggy_collected_dragon_brothers : 1;
            u8 gi_floor1_jiggy_collected_toxic_waste_disposal : 1;
            u8 gi_floor3_jiggy_collected_packing_room : 1;
            u8 gi_floor1_jiggy_collected_trash_compactor : 1;
            u8 gi_floor1_jiggy_collected_guarded_by_tintops : 1;
/* 0x4D */  u8 ccl_jiggy_collected_mr_fit : 1;
            u8 ccl_jiggy_collected_mingy_jongo : 1;
            u8 hfp_lava_jiggy_collected_near_stadium_splitup_buttons : 1;
            u8 hfp_icy_jiggy_collected_aliens : 1;
            u8 hfp_lava_jiggy_collected_kickball : 1;
            u8 hfp_jiggy_collected_tdl : 1;
            u8 hfp_icy_jiggy_collected_oil_rig : 1;
            u8 hfp_icy_jiggy_collected_train_station : 1;
/* 0x4E */  u8 ccl_jiggy_collected_jelly_castle : 1;
            u8 ccl_jiggy_collected_superstash : 1;
            u8 ccl_jiggy_collected_guffo : 1;
            u8 ccl_jiggy_collected_cheese : 1;
            u8 ccl_jiggy_collected_eyeballus_jiggium_plants : 1;
            u8 ccl_jiggy_collected_zzzubas : 1;
            u8 ccl_jiggy_collected_canary_mary : 1;
            u8 ccl_jiggy_collected_pot_o_gold : 1;
/* 0x4F */  u8 jv_jiggy_collected_jinjo_purple : 1;
            u8 jv_jiggy_collected_jinjo_blue : 1;
            u8 jv_jiggy_collected_jinjo_red : 1;
            u8 jv_jiggy_collected_jinjo_green : 1;
            u8 jv_jiggy_collected_jinjo_brown : 1;
            u8 jv_jiggy_collected_jinjo_yellow : 1;
            u8 jv_jiggy_collected_jinjo_orange : 1;
            u8 jv_jiggy_collected_jinjo_white : 1;
/* 0x50 */  u8 ggm_jiggy_spawned_chuffy : 1;
            u8 ggm_jiggy_spawned_canary_mary : 1;
            u8 mt_jiggy_spawned_treasure_chamber : 1;
            u8 mt_jiggy_spawned_ssslumber : 1; // auto set when near ssslumber, if not collected
            u8 mt_jiggy_spawned_kickball : 1;
            u8 mt_jiggy_spawned_bovina : 1;
            u8 ioh_jiggy_collected_jingaling : 1;
            u8 jv_jiggy_collected_jinjo_black : 1;
/* 0x51 */  u8 jrl_jiggy_spawned_jolly : 1;
            u8 tdl_jiggy_spawned_oogle_boogle : 1;
            u8 ww_jiggy_spawned_hoop_hurry : 1;
            u8 jrl_jiggy_spawned_chris_p_bacon : 1;
            u8 _unknown_0x51_3 : 1;
            u8 jrl_jiggy_spawned_seemee : 1; // if !jrl_jiggy_collected_seemee, sets/unsets as you enter/leave scene with jiggy seemee
            u8 jrl_jiggy_spawned_tiptup : 1;
            u8 ww_jiggy_spawned_test_of_strength : 1;
/* 0x52 */  u8 hfp_lava_jiggy_spawned_sabreman : 1;
            u8 ww_jiggy_spawned_mr_patch : 1;
            u8 ggm_jiggy_spawned_dilberta : 1;
            u8 tdl_jiggy_spawned_rocknuts : 1;
            u8 tdl_jiggy_spawned_scrotty : 1; // unused?
            u8 ww_jiggy_spawned_saucer_of_peril : 1;
            u8 ww_jiggy_spawned_dodgem : 1;
            u8 ww_jiggy_spawned_mrs_boggy : 1;
/* 0x53 */  u8 hfp_lava_spawned_jiggy_kickball : 1;
            u8 ioh_jiggy_spawned_jingaling : 1;
            u8 ccl_jiggy_spawned_pot_o_gold : 1;
            u8 _unknown_0x53_4 : 1;
            u8 hfp_lava_jiggy_spawned_inside_volcano : 1;
            u8 tdl_jiggy_spawned_terry_eggs : 1;
            u8 tdl_jiggy_spawned_terry_fight : 1;
            u8 gi_floor4_jiggy_spawned_quality_control : 1;
/* 0x54 */  u8 ccl_jiggy_spawned_eyeballus_jiggium_plants : 1; // if !ccl_jiggy_collected_eyeballus_jiggium_plants: set/unset as you enter/exit scene
            u8 hfp_jiggy_spawned_dragon_brothers : 1;
            u8 jrl_jiggy_spawned_lord_woo_fak_fak : 1;
            u8 ccl_jiggy_spawned_mr_fit : 1;
            u8 jrl_jiggy_spawned_aliens : 1;
            u8 ccl_jiggy_spawned_guffo : 1;
            u8 tdl_jiggy_spawned_chompasaurus : 1;
            u8 gi_floor3_jiggy_spawned_packing_room : 1;
/* 0x55 */  u8 ggm_jiggy_spawned_ordnance_storage : 1;
            u8 hfp_icy_jiggy_spawned_boggy : 1;
            u8 jrl_jiggy_spawned_sea_bottom_cavern : 1;
            u8 ccl_jiggy_spawned_zzzubas : 1;
            u8 gi_jiggy_spawned_workers : 1;
            u8 ww_jiggy_spawned_baloon_burst : 1;
            u8 hfp_icy_jiggy_spawned_aliens : 1;
            u8 ccl_jiggy_spawned_mingy_jongo : 1; // also controls if mingy jongo spawns
/* 0x56 */  u8 ggm_page_entrance : 1;
            u8 ggm_page_canary_mary : 1;
            u8 mt_page_jade_snake : 1;
            u8 mt_page_prison_combound : 1;
            u8 mt_page_treasure_chamber : 1;
            u8 gi_floor4_jiggy_spawned_clinkers_cavern : 1;
            u8 hfp_icy_jiggy_spawned_oil_rig : 1;
            u8 ccl_jiggy_spawned_canary_mary : 1;
/* 0x57 */  u8 tdl_page_dippy : 1;
            u8 jrl_page_ancient_swimming_baths : 1;
            u8 jrl_page_seemee : 1;
            u8 jrl_page_pawno : 1;
            u8 ww_page_saucer_of_peril : 1;
            u8 ww_page_inferno : 1;
            u8 ww_page_haunted_cavern : 1;
            u8 ggm_page_water_storage : 1;
/* 0x58 */  u8 hfp_icy_page_tall_tower : 1;
            u8 hfp_icy_page_icicle_grotto : 1;
            u8 hfp_lava_page_from_stadium : 1;
            u8 gi_floor1_page_weldar : 1;
            u8 gi_floor2_page : 1;
            u8 gi_floor1_page_collected_loggo : 1;
            u8 tdl_page_near_mumbo : 1;
            u8 tdl_page_inside_the_mountain : 1;
/* 0x59 */  u8 ggm_page_spawned_canary_mary : 1;
            u8 ww_page_spawned_saucer_of_peril : 1;
            u8 jrl_page_spawned_seemee_smugglers_cavern : 1; // set/unset when entering/leaving smugglers cavern
            u8 jrl_page_spawned_pawno : 1;
            u8 sm_page_nook : 1;
            u8 ccl_page_collected_zzzubas : 1;
            u8 ccl_page_collected_pot_o_gold : 1;
            u8 ccl_page_collected_canary_mary : 1;
/* 0x5A */  u8 mt_sacred_statue_adjacent_big_pillars_room1 : 1;
            u8 mt_sacred_statue_adjacent_big_pillars_room2 : 1;
            u8 mt_sacred_statue_near_entrance1 : 1;
            u8 mt_sacred_statue_near_entrance2 : 1;
            u8 ccl_page_spawned_canary_mary : 1;
            u8 ccl_page_spawned_zzzubas : 1;
            u8 gi_floor1_page_spawned_loggo : 1;
            u8 ccl_page_spawned_pot_o_gold : 1;
/* 0x5B */  u8 mt_sacred_statue_small_pillars1 : 1;
            u8 mt_sacred_statue_small_pillars2 : 1;
            u8 mt_sacred_statue_small_pillars3 : 1;
            u8 mt_sacred_statue_sput_sput2 : 1;
            u8 mt_sacred_statue_sput_sput1 : 1; // stone statue turret enemy
            u8 mt_sacred_statue_sput_sput3 : 1;
            u8 mt_sacred_statue_sput_sput4 : 1;
            u8 mt_sacred_statue_adjacent_big_pillars_room3 : 1;
/* 0x5C */  u8 mt_sacred_statue_big_pillars4 : 1;
            u8 mt_sacred_statue_big_pillars3 : 1;
            u8 mt_sacred_statue_big_pillars1 : 1;
            u8 mt_sacred_statue_big_pillars2 : 1;
            u8 mt_sacred_statue_big_pillars5 : 1;
            u8 mt_sacred_statue_sput_sput5 : 1;
            u8 mt_sacred_statue_near_sacred_chambers1 : 1;
            u8 mt_sacred_statue_near_sacred_chambers2 : 1;
/* 0x5D */  u8 klungo_potion_order : 3; // 0 = randomize, 7 = no potion (game waits forever for klungo to get an effect)
            u8 mt_sacred_statue_passage_near_entrance1 : 1;
            u8 mt_sacred_statue_passage_near_entrance2 : 1;
            u8 mt_sacred_statue_passage_near_sacred_chambers1 : 1;
            u8 mt_sacred_statue_passage_near_sacred_chambers2 : 1;
            u8 mt_sacred_statue_passage_near_sacred_chambers3 : 1;
/* 0x5E */  u8 hfp_lava_inside_volcano_button4 : 1;
            u8 hfp_lava_inside_volcano_button3 : 1;
            u8 hfp_lava_inside_volcano_button2 : 1;
            u8 hfp_lava_inside_volcano_button1 : 1;
            u8 ccl_murdered_george : 1;
            u8 ck_defeated_klungo3 : 1;
            u8 ioh_defeated_klungo2 : 1;
            u8 ioh_defeated_klungo1 : 1;
/* 0x5F */  u8 tdl_filled_dippys_pool : 1;
            u8 tdl_oogle_boogle_warmth_main : 1;
            u8 tdl_oogle_boogle_warmth_back : 1;
            u8 tdl_oogle_boogle_warmth_upper : 1;
            u8 intro_oogle_boogle_blocker : 1;
            u8 _unknown_0x5F_2 : 1;
            u8 hfp_lava_inside_volcano_button_jiggy : 1;
            u8 hfp_lava_inside_volcano_button5 : 1;
/* 0x60 */  u8 silo_plateau : 1;
            u8 silo_wooded_hollow : 1;
            u8 silo_jinjo_village : 1;
            u8 mt_prison_code : 2; // if 0, randomizes when entering mt prison compound area
            /* Prison Codes
              1: Sun, Moon, Star, Moon, Sun
              2: Star, Sun, Star, Moon, Moon
              3: Moon, Star, Sun, Star, Star
            */
            u8 tdl_opened_caged_entrance_jinjo : 1;
            u8 gi_floor4_opened_wall_crushers : 1;
            u8 intro_dippy : 1;
/* 0x61 */  u8 ccl_opened_buried_items_honeycomb : 1;
            u8 ccl_opened_buried_items_bean1 : 1;
            u8 ccl_opened_buried_items_bean2 : 1;
            u8 tutorial_silos : 1;
            u8 silo_quagmire : 1;
            u8 silo_wasteland : 1;
            u8 silo_cliff_top : 1;
            u8 silo_pine_grove : 1;
/* 0x62 */  u8 intro_sm_fish : 1;
            u8 ccl_collected_bean1 : 1;
            u8 ccl_collected_bean2 : 1;
            u8 ccl_opened_buried_items_empty : 1;
            u8 ccl_opened_buried_items_feathers : 1;
            u8 ccl_opened_buried_items_eggs : 1;
            u8 ccl_opened_buried_items_honeycomb_piece : 1;
            u8 ccl_opened_buried_items_springy_step_shoes : 1;
/* 0x63 */  u8 tutorial_stony : 1;
            u8 tutorial_daddy_trex : 1;
            u8 _unknown_0x63_5 : 1;
            u8 tutorial_jukebox_broken : 1;
            u8 tutorial_gi_battery_required : 1;
            u8 tutorial_mystery_eggs : 1;
            u8 ccl_mr_fit_has_sack_raced : 1;
            u8 tutorial_floatus_floatium_creature : 1;
/* 0x64 */  u8 tutorial_dragon_kazooie : 1;
            u8 tutorial_bee : 1;
            u8 tutorial_snowball : 1;
            u8 tutorial_washer : 1;
            u8 tutorial_baby_trex : 1;
            u8 tutorial_submarine : 1;
            u8 tutorial_van : 1;
            u8 tutorial_detonator : 1;
/* 0x65 */  u8 ccl_planted_bean_sack_race : 1;
            u8 ccl_planted_bean_cheese : 1;
            u8 gi_floor1_opened_fire_exit_door : 1; // not tied to button
            u8 ccl_hatched_floatus_sack_race : 1;
            u8 ccl_hatched_floatus_cheese : 1;
            u8 ccl_hatched_floatus_center : 1;
            u8 hfp_icy_started_oil_rig : 1;
            u8 _unknown_0x65_0 : 1;
/* 0x66 */  u8 jiggywiggy_completed_challenges : 4;
            u8 intro_jiggywiggy : 1;
            u8 ccl_opened_zzzubas : 1;
            u8 ccl_grew_bean_sack_race : 1;
            u8 ccl_grew_bean_cheese : 1;
/* 0x67 */  u8 wh_cutscene : 1;
            u8 mt_opened_code_chamber : 1;
            u8 ww_opened_space_shock_jump : 1;
            u8 tutorial_gi_intruder_alert : 1;
            u8 _unknown_0x67_3 : 1;
            u8 tdl_hatched_big_girl : 2; // if 3, 4th egg is hatched
            u8 jingaling_zombified : 1; // unset after revival cutscene
/* 0x68 */  u8 mt_defeated_targitzan : 1;
            u8 intro_hfp_kickball_welcome : 1;
            u8 _unknown_0x68_5 : 1;
            u8 _unknown_0x68_4 : 1;
            u8 _unknown_0x68_3 : 1;
            u8 _unknown_0x68_2 : 1;
            u8 hfp_lava_opened_kickball_door3 : 1;
            u8 hfp_lava_opened_kickball_door2 : 1;
/* 0x69 */  u8 jrl_defeated_lord_woo_fak_fak : 1;
            u8 hfp_icy_revived_alien_parent : 1;
            u8 hfp_icy_cutscene_aliens_arrived : 1;
            u8 hfp_icy_helped_alien_child_cold : 1;
            u8 hfp_icy_helped_alien_child_dead : 1;
            u8 hfp_icy_helped_alien_child_living : 1;
            u8 intro_hfp_icy_alien_child_cold : 1;
            u8 intro_chompasaurus : 1;
/* 0x6A */  u8 mt_mumbo : 1;
            u8 jinjo_pattern : 6; // set after intro cutscene
            u8 hfp_icy_murdered_mildred : 1;
/* 0x6B */  u8 gi_mumbo : 1;
            u8 ioh_mumbo : 1;
            u8 ccl_mumbo : 1;
            u8 hfp_mumbo : 1;
            u8 tdl_mumbo : 1;
            u8 jrl_mumbo : 1;
            u8 ww_mumbo : 1;
            u8 ggm_mumbo : 1;
/* 0x6C */  u8 hfp_lava_opened_flight_pad_shortcut : 1;
            u8 intro_guffo : 1;
            u8 ccl_superstash_open : 1;
            u8 ccl_superstash_button_trashcan : 1;
            u8 ccl_superstash_button_cental_cavern_high_bridge : 1;
            u8 ccl_superstash_button_cental_cavern_above_superstash : 1;
            u8 ccl_superstash_button_near_buried_items : 1;
            u8 intro_superstash : 1;
/* 0x6D */  u8 gi_open : 1;
            u8 tdl_open : 1;
            u8 jrl_open : 1;
            u8 ww_open : 1;
            u8 ggm_open : 1;
            u8 mt_open : 1; // levels auto open if jiggywiggy_completed_challenges indicates they should be open
            u8 ioh_opened_bridge_hfp : 1;
            u8 hfp_lava_opened_waterfall_jinjo_pillars : 1;
/* 0x6E */  u8 jrl_locker_names2 : 1; // part of jrl_locker_names. got separated?
            u8 jv_jinjo_unknown : 1; // set when saving 1st jinjo?
            u8 jrl_opened_mumbos_wall : 1;
            u8 hfp_opened_mumbos_wall : 1;
            u8 hag1_open : 1;
            u8 ck_open : 1;
            u8 ccl_open : 1;
            u8 hfp_open : 1;
/* 0x6F */  u8 _unknown_0x6F_7 : 1;
            u8 jrl_locker_names : 7; // if 0, gets randomized when entering jrl big fish cavern from seaweed sanctum
/* 0x70 */  u8 mt_warp_pad_humba : 1;
            u8 mt_warp_pad_prison_compound : 1;
            u8 mt_warp_pad_mumbo : 1;
            u8 mt_warp_pad_entrance : 1;
            u8 jrl_opened_alien_ship : 1;
            u8 sm_opened_jinjo : 1;
            u8 jrl_opened_jollys_wall : 1;
            u8 jrl_opened_davy_jones_locker : 1;
/* 0x71 */  u8 ww_warp_pad_behind_big_top : 1;
            u8 ww_warp_pad_entrance : 1;
            u8 ggm_warp_pad_train_station : 1;
            u8 ggm_warp_pad_crushing_shed : 1;
            u8 ggm_warp_pad_humba : 1;
            u8 ggm_warp_pad_mumbo : 1;
            u8 ggm_warp_pad_entrance : 1;
            u8 mt_warp_pad_kickball : 1;
/* 0x72 */  u8 jrl_warp_pad_lockers_cavern : 1;
            u8 jrl_warp_pad_big_fish_cavern : 1;
            u8 jrl_warp_pad_sunken_ship : 1;
            u8 jrl_warp_pad_atlantis : 1;
            u8 jrl_warp_pad_entrance : 1;
            u8 ww_warp_pad_mumbo : 1;
            u8 ww_warp_pad_humba : 1;
            u8 ww_warp_pad_space : 1;
/* 0x73 */  u8 gi_floor3_warp_pad_mumbo : 1;
            u8 gi_floor2_warp_pad_humba : 1;
            u8 gi_floor1_warp_pad_entrance : 1;
            u8 tdl_warp_pad_path_to_nest : 1;
            u8 tdl_warp_pad_humba : 1;
            u8 tdl_warp_pad_mumbo : 1;
            u8 tdl_warp_pad_stomping_plains : 1;
            u8 tdl_warp_pad_entrance : 1;
/* 0x74 */  u8 ccl_warp_pad_entrance : 1;
            u8 hfp_icy_warp_pad_icicle_grotto : 1;
            u8 hfp_icy_warp_pad_humba : 1;
            u8 hfp_icy_warp_pad_upper : 1;
            u8 hfp_lava_warp_pad_upper : 1;
            u8 hfp_lava_warp_pad_entrance : 1;
            u8 gi_roof_warp_pad : 1;
            u8 gi_floor4_warp_pad_crushers : 1;
/* 0x75 */  u8 _unknown_0x75_7 : 1;
            u8 _unknown_0x75_6 : 1;
            u8 ck_warp_pad_hag1 : 1;
            u8 ck_warp_pad_entrance : 1;
            u8 _unknown_0x75_3 : 1;
            u8 _unknown_0x75_2 : 1;
            u8 _unknown_0x75_1 : 1;
            u8 ccl_warp_pad_center : 1;
/* 0x76 */  u8 ccl_cutscene_opened_zzzubas : 1;
            u8 _unknown_0x76_6 : 1;
            u8 ccl_beat_mr_fit_sack_race : 1;
            u8 ccl_beat_mr_fit_high_jump : 1;
            u8 intro_mr_fit_sprint : 1;
            u8 intro_mr_fit_sack_race : 1;
            u8 intro_mr_fit_high_jump : 1;
            u8 _unknown_0x76_0 : 1;
/* 0x77 */  u8 wh_yellow_egg_hatched : 1;
            u8 wh_pink_egg_hatched : 1;
            u8 sm_pink_egg_collected : 1; // behind gate, set to 0 when traded
            u8 wh_blue_egg_hatched : 1;
            u8 sm_blue_egg_collected : 1; // behind waterfall, set to 0 when traded
            u8 opened_mega_glowbo : 1;
            u8 _unknown_0x77_1 : 1;
            u8 _unknown_0x77_0 : 1;
/* 0x78 */  u8 ggm_opened_water_cavern_mega_glowbo : 1;
            u8 tutorial_warp_pads : 1;
            u8 intro_jiggywiggy_disciple : 1;
            u8 dragon_kazooie : 1;
            u8 _unknown_0x78_3 : 1;
            u8 ioh_opened_plateau_fire_egg_door : 1;
            u8 tutorial_first_jiggywiggy_challenge_completed : 1;
            u8 intro_heggy : 1;
/* 0x79 */  u8 jrl_opened_buried_shock_jump_alcove : 1;
            u8 jrl_opened_buried_doubloon_jollys : 1;
            u8 jrl_opened_buried_doubloon_pawnos : 1;
            u8 jrl_opened_buried_doubloon_entrance : 1;
            u8 _unknown_0x79_3 : 1;
            u8 _unknown_0x79_2 : 1;
            u8 _unknown_0x79_1 : 1;
            u8 ioh_opened_pine_grove_wasteland : 1;
/* 0x7A */  u8 _unknown_0x7A_7 : 1;
            u8 _unknown_0x7A_6 : 1;
            u8 _unknown_0x7A_5 : 1;
            u8 _unknown_0x7A_4 : 1;
            u8 _unknown_0x7A_3 : 1;
            u8 _unknown_0x7A_2 : 1;
            u8 _unknown_0x7A_1 : 1;
            u8 jrl_opened_buried_shock_jump_jollys : 1;
/* 0x7B */  u8 hfp_lava_cutscene_chilli_billi_weakness : 1;
            u8 hfp_icy_cutscene_chilly_willy_weakness : 1;
            u8 hfp_lava_cutscene_chilli_billi_lick : 1;
            u8 hfp_icy_cutscene_chilly_willy_lick : 1;
            u8 ioh_opened_train : 1;
            u8 _unknown_0x7B_2 : 1;
            u8 _unknown_0x7B_1 : 1;
            u8 _unknown_0x7B_0 : 1;
/* 0x7C */  u8 ggm_mumbo_crushing_shed_jiggy_pieces : 1;
            u8 tutorial_skill_stop_honeycomb : 1;
            u8 tutorial_random_stop_honeycomb : 1;
            u8 intro_jamjars_first_meeting : 1;
            u8 _unknown_0x7C_3 : 1;
            u8 ccl_mumbo_location : 2; // if 1: blue skull, elif 3: red skull, else randomize
            u8 intro_mingy_jongo : 1;
/* 0x7D */  u8 tutorial_ww_saucer_of_peril : 1;
            u8 _unknown_0x7D_6 : 1;
            u8 _unknown_0x7D_5 : 1;
            u8 intro_ww_saucer_of_peril : 1;
            u8 intro_ww_saucer_of_peril_offline : 1;
            u8 ggm_jiggy_collected_crushing_shed_pieces1 : 1;
            u8 ggm_jiggy_collected_crushing_shed_pieces2 : 1;
            u8 ggm_jiggy_collected_crushing_shed_pieces3 : 1;
/* 0x7E */  u8 intro_hfp_kickball1 : 1;
            u8 intro_mt_kickball3 : 1;
            u8 intro_mt_kickball2 : 1;
            u8 intro_mt_kickball1 : 1;
            u8 intro_ww_dodgem3 : 1;
            u8 intro_ww_dodgem2 : 1;
            u8 intro_ww_dodgem1 : 1;
            u8 _unknown_0x7E_0 : 1;
/* 0x7F */  u8 _unknown_0x7F_7 : 1;
            u8 _unknown_0x7F_6 : 1;
            u8 _unknown_0x7F_5 : 1;
            u8 intro_jamjars_first_lesson : 1;
            u8 ccl_cutscene_mingy_jongo_first_hit : 1;
            u8 intro_jamjars_first_rations : 1;
            u8 intro_hfp_kickball3 : 1;
            u8 intro_hfp_kickball2 : 1;
/* 0x80 */  union {
              /*
                if gi_cleaned_workers: gi_workers_last_cleaned holds location of the last cleaned worker, where jiggy will be
                else: gi_workers_cleaned holds which workers have been cleaned
                gi_workers_last_cleaned values to locations:
                  1 - outside
                  2 - floor 5
                  3 - floor 2
                  4 - floor 3
                  5 - floor 1 quarters
                  6 - floor 1 compactor
              */
              struct {
                u8 floor2 : 1;
                u8 floor5 : 1;
                u8 outside : 1;
                u8 _unused : 5;
              } gi_workers_cleaned;
              struct {
                u8 gi_workers_last_cleaned : 3;
                u8 intro_gi_worker_rabbits : 1;
                u8 intro_ccl_canary_mary : 1;
                u8 intro_ggm_canary_mary : 1;
                u8 tutorial_mumbo : 1;
                u8 tutorial_kickball : 1;
              };
            }; // combined due to gi_workers
/* 0x81 */  u8 intro_boggy : 1;
            u8 ck_opened_drawbridge : 1;
            u8 intro_ssslumber_left : 1;
            u8 intro_ssslumber : 1;
            u8 gi_cleaned_workers : 1;
            u8 gi_floor1_cleaned_compactor_worker : 1;
            u8 gi_floor1_cleaned_quarters_worker : 1;
            u8 gi_floor3_cleaned_worker : 1;
/* 0x82 */  u8 intro_hfp_lava_not_welcome : 1; // im gonna burn your furry hide
            u8 intro_hfp_icy_not_welcome : 1;
            u8 jv_cutscene_completed_first_family : 1;
            u8 jv_cutscene_saved_first_jinjo : 1;
            u8 ioh_opened_plateau_splitup_door : 1;
            u8 gi_floor1_opened_toxic_waste_disposal_jiggy : 1;
            u8 hfp_icy_boggy_fed : 1;
            u8 hfp_lava_fish_collected : 1;
/* 0x83 */  u8 hfp_icy_boggy_gave_fish : 1;
            u8 cheats_homing_eggs_unlocked : 1;
            u8 _unknown_0x83_5 : 1;
            u8 tower_of_tragedy_round : 3; // 0 = intro, 1 = round 1, 2 = round 2, 3 = round 3, 4 = completed
            u8 tower_of_tragedy_completed : 1; // if set and hasnt played before, plays revival cutscene on file load
            u8 ck_opened_gun_chamber : 1; // useless, lasers dont hurt or block
/* 0x84 */  u8 mt_notes_before_goliath1 : 1;
            u8 _unknown_0x84_6 : 1;
            u8 _unknown_0x84_5 : 1;
            u8 _unknown_0x84_4 : 1;
            u8 _unknown_0x84_3 : 1;
            u8 _unknown_0x84_2 : 1;
            u8 intro_chris_p_bacon : 1;
            u8 intro_mr_fit_sprint_with_turbo_trainers : 1;
/* 0x85 */  u8 mt_notes_before_mumbo1 : 1;
            u8 mt_notes_after_goliath4 : 1;
            u8 mt_notes_after_goliath3 : 1;
            u8 mt_notes_after_goliath2 : 1;
            u8 mt_notes_after_goliath1 : 1;
            u8 mt_notes_before_goliath4 : 1;
            u8 mt_notes_before_goliath3 : 1;
            u8 mt_notes_before_goliath2 : 1;
/* 0x86 */  u8 mt_notes_tc_behind_temple : 1;
            u8 mt_notes_mumbo : 1;
            u8 mt_notes_after_mumbo3 : 1;
            u8 mt_notes_after_mumbo2 : 1;
            u8 mt_notes_after_mumbo1 : 1;
            u8 mt_notes_before_mumbo4 : 1;
            u8 mt_notes_before_mumbo3 : 1;
            u8 mt_notes_before_mumbo2 : 1;
/* 0x87 */  u8 ggm_notes_near_prospectors_hut1 : 1;
            u8 ggm_notes_near_prospectors_hut2 : 1;
            u8 ggm_notes_near_prospectors_hut3 : 1;
            u8 ggm_notes_near_prospectors_hut4 : 1;
            u8 ggm_notes_near_crushing_shed1 : 1;
            u8 ggm_notes_near_crushing_shed2 : 1;
            u8 ggm_notes_near_crushing_shed3 : 1;
            u8 ggm_notes_near_crushing_shed4 : 1;
/* 0x88 */  u8 ggm_notes_fuel_depot1 : 1;
            u8 ggm_notes_fuel_depot2 : 1;
            u8 ggm_notes_fuel_depot3 : 1;
            u8 ggm_notes_fuel_depot4 : 1;
            u8 ggm_notes_near_mumbo1 : 1;
            u8 ggm_notes_near_mumbo2 : 1;
            u8 ggm_notes_near_mumbo3 : 1;
            u8 ggm_notes_near_prospectors_hut5 : 1;
/* 0x89 */  u8 ww_notes_big_top_western : 1;
            u8 ww_notes_big_top_western_spooky : 1;
            u8 ww_notes_big_top_spooky : 1;
            u8 ww_notes_big_top_spooky_space : 1;
            u8 ww_notes_big_top_space : 1;
            u8 ww_notes_big_top_space_entrance : 1;
            u8 ww_notes_big_top_entrance : 1;
            u8 ggm_notes_tc_water_storage : 1;
/* 0x8A */  u8 ww_notes_western1 : 1;
            u8 ww_notes_spooky1 : 1;
            u8 ww_notes_spooky2 : 1;
            u8 ww_notes_space1 : 1;
            u8 ww_notes_space2 : 1;
            u8 ww_notes_electric_fence1 : 1;
            u8 ww_notes_electric_fence2 : 1;
            u8 ww_notes_big_top_entrance_western : 1;
/* 0x8B */  u8 jrl_notes_atlantis1 : 1;
            u8 jrl_notes_blubbul1 : 1;
            u8 jrl_notes_blubbul2 : 1;
            u8 jrl_notes_outside_blubbers : 1;
            u8 jrl_notes_outside_pawnos : 1;
            u8 jrl_notes_outside_jollys : 1;
            u8 ww_notes_tc_space : 1;
            u8 ww_notes_western2 : 1;
/* 0x8C */  u8 jrl_notes_jollys1 : 1;
            u8 jrl_notes_pawnos1 : 1;
            u8 jrl_notes_pawnos2 : 1;
            u8 jrl_notes_pawnos3 : 1;
            u8 jrl_notes_blubbers1 : 1;
            u8 jrl_notes_blubbers2 : 1;
            u8 jrl_notes_blubbers3 : 1;
            u8 jrl_notes_atlantis2 : 1;
/* 0x8D */  u8 tdl_notes_lower_lake1 : 1;
            u8 tdl_notes_lower_lake2 : 1;
            u8 tdl_notes_near_train_station1 : 1;
            u8 tdl_notes_near_train_station2 : 1;
            u8 tdl_notes_near_train_station3 : 1;
            u8 jrl_notes_tc_blubbul_atlantis : 1;
            u8 jrl_notes_jollys2 : 1;
            u8 jrl_notes_jollys3 : 1;
/* 0x8E */  u8 tdl_notes_river_passage1 : 1;
            u8 tdl_notes_roar_cage1 : 1;
            u8 tdl_notes_roar_cage2 : 1;
            u8 tdl_notes_roar_cage3 : 1;
            u8 tdl_notes_path_to_nest1 : 1;
            u8 tdl_notes_path_to_nest2 : 1;
            u8 tdl_notes_path_to_nest3 : 1;
            u8 tdl_notes_lower_lake3 : 1;
/* 0x8F */  u8 gi_floor1_notes_ac1 : 1;
            u8 gi_floor1_notes_train_station1 : 1;
            u8 gi_floor1_notes_train_station2 : 1;
            u8 gi_floor1_notes_train_station3 : 1;
            u8 tdl_notes_tc_near_humba : 1;
            u8 tdl_notes_river_passage2 : 1;
            u8 tdl_notes_river_passage3 : 1;
            u8 tdl_notes_river_passage4 : 1;
/* 0x90 */  u8 gi_floor1_notes_toxic_waste_disposal1 : 1;
            u8 gi_floor1_notes_toxic_waste_disposal2 : 1;
            u8 gi_floor2_notes_near_humba1 : 1;
            u8 gi_floor2_notes_near_humba2 : 1;
            u8 gi_floor2_notes_toxic_room1 : 1;
            u8 gi_floor2_notes_toxic_room2 : 1;
            u8 gi_floor2_notes_toxic_room3 : 1;
            u8 gi_floor1_notes_ac2 : 1;
/* 0x91 */  u8 hfp_lava_notes_near_mumbo1 : 1;
            u8 hfp_lava_notes_near_shack_pack1 : 1;
            u8 hfp_lava_notes_near_shack_pack2 : 1;
            u8 gi_outside_notes_tc_above_building_entrance : 1;
            u8 gi_floor3_notes_upper_platforms1 : 1;
            u8 gi_floor3_notes_upper_platforms2 : 1;
            u8 gi_floor1_notes_air_con_plant1 : 1;
            u8 gi_floor1_notes_air_con_plant2 : 1;
/* 0x92 */  u8 hfp_icy_notes_near_claw_clamber_boots1 : 1;
            u8 hfp_icy_notes_near_oil_rig1 : 1;
            u8 hfp_icy_notes_near_oil_rig2 : 1;
            u8 hfp_lava_notes_ladder1 : 1;
            u8 hfp_lava_notes_ladder2 : 1;
            u8 hfp_lava_notes_near_warp_pad1 : 1;
            u8 hfp_lava_notes_near_warp_pad2 : 1;
            u8 hfp_lava_notes_near_mumbo2 : 1;
/* 0x93 */  u8 ccl_notes_blue_skull_exit : 1;
            u8 ccl_notes_above_jamjars : 1;
            u8 hfp_icy_notes_tc_icicle_grotto : 1;
            u8 hfp_icy_notes_near_humba1 : 1;
            u8 hfp_icy_notes_near_humba2 : 1;
            u8 hfp_icy_notes_near_boggy1 : 1;
            u8 hfp_icy_notes_near_boggy2 : 1;
            u8 hfp_icy_notes_near_claw_clamber_boots2 : 1;
/* 0x94 */  u8 ccl_notes_claw_clamber_boots_exit : 1;
            u8 ccl_notes_red_skull : 1;
            u8 ccl_notes_mr_fit_sprint_exit : 1;
            u8 ccl_notes_dippy_exit : 1;
            u8 ccl_notes_pot_o_gold_exit : 1;
            u8 ccl_notes_cheese_exit : 1;
            u8 ccl_notes_with_jamjars1 : 1;
            u8 ccl_notes_with_jamjars2 : 1;
/* 0x95 */  u8 ioh_notes_plateau_sign1 : 1;
            u8 ccl_notes_tc_high_bridge : 1;
            u8 ccl_notes_splitup_banjo : 1;
            u8 ccl_notes_splitup_kazooie : 1;
            u8 ccl_notes_warp_pad : 1;
            u8 ccl_notes_glowbo_exit : 1;
            u8 ccl_notes_high_bridge_code_button_exit : 1;
            u8 ccl_notes_high_bridge_exit : 1;
/* 0x96 */  u8 ioh_notes_cliff_top_hfp1 : 1;
            u8 ioh_notes_pine_grove_underwater1 : 1;
            u8 ioh_notes_pine_grove_underwater2 : 1;
            u8 ioh_notes_pine_grove_land1 : 1;
            u8 ioh_notes_pine_grove_land2 : 1;
            u8 ioh_notes_plateau_hive1 : 1;
            u8 ioh_notes_plateau_hive2 : 1;
            u8 ioh_notes_plateau_sign2 : 1;
/* 0x97 */  u8 ioh_notes_tc_atop_jinjo_house : 1;
            u8 ioh_notes_wasteland_ccl1 : 1;
            u8 ioh_notes_wasteland_ccl2 : 1;
            u8 ioh_notes_wasteland_jinjo1 : 1;
            u8 ioh_notes_wasteland_jinjo2 : 1;
            u8 ioh_notes_cliff_top_hfp2 : 1;
            u8 ioh_notes_cliff_top_hfp3 : 1;
            u8 ioh_notes_cliff_top_hfp4 : 1;
/* 0x98 */  u8 train_at_gi : 1;
            u8 train_at_ww : 1;
            u8 train_at_ggm : 1;
            u8 trade_honey_b : 3; // 0 through 5,
            u8 intro_honey_b : 1;
            u8 tutorial_jiggywiggy_alter_of_knowledge : 1;
/* 0x99 */  u8 jrl_big_fish_tooth1 : 1;
            u8 jrl_big_fish_tooth2 : 1;
            u8 tutorial_splitup : 1;
            u8 tutorial_splitup_pads : 1;
            u8 train_at_ioh : 1;
            u8 train_at_hfp_lava : 1;
            u8 train_at_hfp_icy : 1;
            u8 train_at_tdl : 1;
/* 0x9A */  u8 ggm_mumbo_crushing_shed_crushing : 1;
            u8 _unknown_0x9A_6 : 1;
            u8 ggm_mumbo_crushing_shed_levitated : 1;
            u8 ggm_mumbo_crushing_shed_levitating : 1;
            u8 ggm_crushing_shed_on : 1;
            u8 jrl_big_fish_tooth3 : 1;
            u8 jrl_big_fish_tooth4 : 1;
            u8 jrl_big_fish_tooth5 : 1;
/* 0x9B */  u8 ggm_cutscene_canary_mary_left_cave : 1;
            u8 mt_cutscene_jamjars : 1;
            u8 humba_cutscene_mumbo_not_welcome : 1;
            u8 _unknown_0x9B_4 : 1; // set when completing witchyworld jiggywiggy challenge
            u8 ggm_opened_timed_gate : 1;
            u8 _unknown_0x9B_2 : 1;
            u8 ggm_cutscene_timed_gate : 1;
            u8 ggm_mumbo_crushing_shed_crushed : 1;
/* 0x9C */  u8 ww_ticket_collected_western : 1;
            u8 ww_ticket_collected_spooky : 1;
            u8 ww_ticket_collected_space : 1;
            u8 ww_ticket_collected_entrance : 1;
            u8 jrl_doubloon_spawned_buried_spot_jollys : 1;
            u8 jrl_doubloon_spawned_buried_spot_pawnos : 1;
            u8 jrl_doubloon_spawned_buried_spot_entrance : 1;
            u8 tutorial_ggm_canary_mary : 1;
/* 0x9D */  u8 ggm_opened_ordnance_storage : 1;
            u8 mt_opened_flight_pad : 1;
            u8 mt_opened_columns_vault : 1;
            u8 mt_opened_prison_compound_ggm : 1;
            u8 ww_ticket_spawned_western : 1;
            u8 ww_ticket_spawned_spooky : 1;
            u8 ww_ticket_spawned_space : 1;
            u8 ww_ticket_spawned_entrance : 1;
/* 0x9E */  u8 _unknown_0x9E_7 : 1;
            u8 sm_opened_fish : 1;
            u8 ggm_opened_toxic_gas_cave_boulder_eggs : 1;
            u8 ggm_opened_toxic_gas_cave_boulder_honeycomb : 1;
            u8 ggm_opened_gloomy_caverns_near_power_hut_boulder : 1;
            u8 ggm_opened_gloomy_caverns_near_jinjo_boulder : 1;
            u8 ggm_opened_near_mumbo_boulder : 1;
            u8 ggm_opened_near_prospectors_hut_boulder : 1;
/* 0x9F */  u8 _unknown_0x9F_7 : 1;
            u8 ioh_opened_plateau_boulder : 1;
            u8 tdl_opened_boulder_near_humba : 1;
            u8 tdl_opened_scrotty_shock_jump : 1;
            u8 tdl_opened_scrotty_mumbo_pad : 1;
            u8 tdl_opened_boulder_oogle_boogle : 1;
            u8 tdl_opened_boulder_near_mumbo : 1;
            u8 ggm_opened_jinjo_near_train_station_boulder : 1;
/* 0xA0 */  u8 _unknown_0xA0_7 : 1;
            u8 _unknown_0xA0_6 : 1;
            u8 _unknown_0xA0_5 : 1;
            u8 _unknown_0xA0_4 : 1;
            u8 _unknown_0xA0_3 : 1;
            u8 _unknown_0xA0_2 : 1;
            u8 ggm_opened_toxic_gas_cave_boulder_feathers : 1;
            u8 _unknown_0xA0_0 : 1;
/* 0xA1 */  u8 cheats_honeyback_enabled : 1;
            u8 cheats_fallproof_enabled : 1;
            u8 cheats_eggs_enabled : 1;
            u8 cheats_feathers_enabled : 1;
            u8 tutorial_jiggywiggy_monolith : 1;
            u8 wh_jiggywiggy_door_auto_opens : 1;
            u8 _unknown_0xA1_1 : 1;
            u8 _unknown_0xA1_0 : 1;
/* 0xA2 */  u8 jukebox_banjos_house : 1;
            u8 jukebox_spiral_mountain : 1;
            u8 cheats_nestking_enabled : 1;
            u8 cheats_honeyking_enabled : 1;
            u8 cheats_superbaddy_enabled : 1;
            u8 cheats_superbanjo_enabled : 1;
            u8 cheats_getjiggy_enabled : 1;
            u8 cheats_jukebox_enabled : 1;
/* 0xA3 */  u8 jukebox_ww_minigame : 1;
            u8 jukebox_witchyworld : 1;
            u8 jukebox_boss_chuffy : 1;
            u8 jukebox_ggm_minigame : 1;
            u8 jukebox_ggm : 1;
            u8 jukebox_boss_targitzan : 1;
            u8 jukebox_mt : 1;
            u8 jukebox_boss_klungo : 1;
/* 0xA4 */  u8 jukebox_boss_lord_woo_fak_fak : 1;
            u8 jukebox_jrl_minigame : 1;
            u8 jukebox_alien_ship_happy : 1;
            u8 jukebox_alien_ship_sad : 1;
            u8 jukebox_jrl_atlantis : 1;
            u8 jukebox_jrl : 1;
            u8 jukebox_boss_mr_patch : 1;
            u8 jukebox_ww_madame_grunty : 1;
/* 0xA5 */  u8 jukebox_boss_mingy_jongo : 1;
            u8 jukebox_ccl : 1;
            u8 jukebox_boss_dragon_brothers : 1;
            u8 jukebox_hfp : 1;
            u8 jukebox_boss_weldar : 1;
            u8 jukebox_gi : 1;
            u8 jukebox_boss_terry : 1;
            u8 jukebox_unga_bunga_cave : 1;
/* 0xA6 */  u8 jukebox_jinjo_house_sad : 1;
            u8 jukebox_jv : 1;
            u8 jukebox_wooded_hollow : 1;
            u8 jukebox_boss_hag1 : 1;
            u8 jukebox_credits : 1;
            u8 jukebox_ck_tower_of_tragedy : 1;
            u8 jukebox_ck : 1;
            u8 jukebox_ccl_minigame : 1;
/* 0xA7 */  u8 jukebox_turbo_trainers : 1;
            u8 jukebox_honey_b_hive : 1;
            u8 jukebox_jiggywiggy_temple : 1;
            u8 jukebox_heggys_egg_shed : 1;
            u8 jukebox_bottles_house : 1;
            u8 jukebox_zombified_jingaling_throne : 1;
            u8 jukebox_jingaling_throne : 1;
            u8 jukebox_jinjo_house_happy : 1;
/* 0xA8 */  u8 _unknown_0xA8_7 : 1;
            u8 _unknown_0xA8_6 : 1;
            u8 jukebox_bottles_house_party : 1;
            u8 jukebox_theres_trouble : 1; // first set with klungo1
            u8 jukebox_clockwork_kazooie : 1;
            u8 jukebox_claw_clamber_boots : 1;
            u8 jukebox_springy_step_shoes : 1;
            u8 jukebox_wading_boots : 1;
/* 0xA9 */  u8 hfp_lava_opened_kickball_door1 : 1;
            u8 mt_opened_kickball_door1 : 1;
            u8 _unknown_0xA9_5 : 1;
            u8 tutorial_ww_no_food_outside_entrance : 1;
            u8 tutorial_ww_no_food_outside_train : 1;
            u8 _unknown_0xA9_2 : 1;
            u8 _unknown_0xA9_1 : 1;
            u8 _unknown_0xA9_0 : 1;
/* 0xAA */  u8 gi_floor4_mumbo_wall_crushers : 1; // unused?
            u8 gi_floor2_mumbo_electromagnet : 1; // unused?
            u8 tdl_cutscene_enlarge_wigwam : 1;
            u8 mt_cutscene_goliath : 1;
            u8 _unknown_0xAA_3 : 1;
            u8 ggm_cutscene_canary_mary_leaving_cage : 1;
            u8 _unknown_0xAA_1 : 1;
            u8 bottles_revived : 1; // set during intro, then unset. set during revival cutscene
/* 0xAB */  u8 _unknown_0xAB_7 : 1;
            u8 played_tower_of_tragedy_round3 : 1;
            u8 played_tower_of_tragedy_round2 : 1;
            u8 played_tower_of_tragedy_round1 : 1;
            u8 ck_tower_of_tragedy_mingella_lost : 1;
            u8 ck_tower_of_tragedy_blobbelda_lost : 1;
            u8 wh_opened_splitup_heggy : 1;
            u8 ccl_mumbo_rainbow_bridge : 1;
/* 0xAC */  u8 ccl_plants_entrance_to_buried_items : 1;
            u8 ck_opened_keep_entrance_lasers : 1;
            u8 _unknown_0xAC_5 : 1;
            u8 _unknown_0xAC_4 : 1;
            u8 _unknown_0xAC_3 : 1;
            u8 jiggywiggy_laser_cutscene : 1;
            u8 jiggywiggy_completed_special_challenge : 1;
            u8 tdl_missing_dino_on_train : 1;
/* 0xAD */  u8 ccl_plants_pot_o_gold_to_pot_o_gold_button : 1;
            u8 ccl_plants_jelly_castle_to_blue_skull : 1;
            u8 ccl_plants_blue_skull_to_jelly_castle : 1;
            u8 ccl_plants_trash_can_to_red_skull : 1;
            u8 ccl_plants_red_skull_to_trash_can : 1;
            u8 ccl_plants_sack_race_end_to_red_skull_upper : 1;
            u8 ccl_plants_humba_to_near_buried_items : 1;
            u8 ccl_plants_buried_items_to_entrance : 1;
/* 0xAE */  u8 ww_soggy_location1 : 1;
            u8 ww_moggy_location : 2; // if 0, randomize all 3 kid's locations when entering witchyworld
            u8 mt_opened_treasure_chamber_upper : 1;
            u8 ccl_plants_near_buried_items_to_humba : 1;
            u8 ccl_plants_sack_race_start_to_red_skull_upper : 1;
            u8 ccl_plants_cheese_to_blue_skull_upper : 1;
            u8 _unknown_0xAE_0 : 1;
/* 0xAF */  u8 _unknown_0xAF_7 : 1;
            u8 _unknown_0xAF_6 : 1;
            u8 _unknown_0xAF_5 : 1;
            u8 cheats_homing_eggs_received : 1;
            u8 cheats_homing_eggs_enabled : 1;
            u8 ww_groggy_location : 2;
            u8 ww_soggy_location2 : 1;
            /* Boggy's kid's locations
              ww_soggy_location = (ww_soggy_location1 << 1) | ww_soggy_location2
              1:
                Groggy: Train Station
                Soggy: Star Spinner
                Moggy: Area 51
              2:
                Groggy: Inferno
                Soggy: Inferno
                Moggy: Cave of Horrors
              3:
                Groggy: Next to Dodgem
                Soggy: Crazy Castle
                Moggy: Inside Dodgem
            */
  } *flags;
  struct {
/* 0x00 */  u8 _unknown_0x00_7 : 1;
            u8 _unknown_0x00_6 : 1;
            u8 _unknown_0x00_5 : 1;
            u8 _unknown_0x00_4 : 1;
            u8 _unknown_0x00_3 : 1;
            u8 _unknown_0x00_2 : 1;
            u8 _unknown_0x00_1 : 1;
            u8 _unknown_0x00_0 : 1;
/* 0x01 */  u8 _unknown_0x01_7 : 1;
            u8 _unknown_0x01_6 : 1;
            u8 _unknown_0x01_5 : 1;
            u8 _unknown_0x01_4 : 1;
            u8 _unknown_0x01_3 : 1;
            u8 _unknown_0x01_2 : 1;
            u8 _unknown_0x01_1 : 1;
            u8 _unknown_0x01_0 : 1;
/* 0x02 */  u8 _unknown_0x02_7 : 1;
            u8 _unknown_0x02_6 : 1;
            u8 _unknown_0x02_5 : 1;
            u8 _unknown_0x02_4 : 1;
            u8 _unknown_0x02_3 : 1;
            u8 _unknown_0x02_2 : 1;
            u8 _unknown_0x02_1 : 1;
            u8 _unknown_0x02_0 : 1;
/* 0x03 */  u8 _unknown_0x03_7 : 1;
            u8 _unknown_0x03_6 : 1;
            u8 _unknown_0x03_5 : 1;
            u8 _unknown_0x03_4 : 1;
            u8 _unknown_0x03_3 : 1;
            u8 _unknown_0x03_2 : 1;
            u8 _unknown_0x03_1 : 1;
            u8 _unknown_0x03_0 : 1;
/* 0x04 */  u8 _unknown_0x04_7 : 1;
            u8 _unknown_0x04_6 : 1;
            u8 _unknown_0x04_5 : 1;
            u8 _unknown_0x04_4 : 1;
            u8 _unknown_0x04_3 : 1;
            u8 _unknown_0x04_2 : 1;
            u8 _unknown_0x04_1 : 1;
            u8 _unknown_0x04_0 : 1;
/* 0x05 */  u8 _unknown_0x05_7 : 1;
            u8 _unknown_0x05_6 : 1;
            u8 _unknown_0x05_5 : 1;
            u8 _unknown_0x05_4 : 1;
            u8 _unknown_0x05_3 : 1;
            u8 _unknown_0x05_2 : 1;
            u8 _unknown_0x05_1 : 1;
            u8 _unknown_0x05_0 : 1;
/* 0x06 */  u8 _unknown_0x06_7 : 1;
            u8 _unknown_0x06_6 : 1;
            u8 _unknown_0x06_5 : 1;
            u8 _unknown_0x06_4 : 1;
            u8 _unknown_0x06_3 : 1;
            u8 _unknown_0x06_2 : 1;
            u8 _unknown_0x06_1 : 1;
            u8 _unknown_0x06_0 : 1;
/* 0x07 */  u8 _unknown_0x07_7 : 1;
            u8 _unknown_0x07_6 : 1;
            u8 _unknown_0x07_5 : 1;
            u8 _unknown_0x07_4 : 1;
            u8 _unknown_0x07_3 : 1;
            u8 _unknown_0x07_2 : 1;
            u8 _unknown_0x07_1 : 1;
            u8 _unknown_0x07_0 : 1;
/* 0x08 */  u8 _unknown_0x08_7 : 1;
            u8 _unknown_0x08_6 : 1;
            u8 _unknown_0x08_5 : 1;
            u8 _unknown_0x08_4 : 1;
            u8 _unknown_0x08_3 : 1;
            u8 _unknown_0x08_2 : 1;
            u8 _unknown_0x08_1 : 1;
            u8 _unknown_0x08_0 : 1;
/* 0x09 */  u8 hag1_phase4_intro : 1;
            u8 hag1_phase3_intro : 1;
            u8 hag1_phase2_intro : 1;
            u8 hag1_quiz_incorrect : 1;
            u8 hag1_quiz_correct : 1;
            u8 hag1_breegull_blaster_intro : 1;
            u8 hag1_quiz_intro : 1;
            u8 hag1_phase1_intro : 1;
/* 0x0A */  u8 _unknown_0x0A_7 : 1;
            u8 _unknown_0x0A_6 : 1;
            u8 _unknown_0x0A_5 : 1;
            u8 hag1_phase8_intro : 1;
            u8 hag1_phase7_intro : 1;
            u8 hag1_phase6_intro : 1;
            u8 hag1_phase9_intro : 1;
            u8 hag1_phase5_intro : 1;
  } *temp_flags;
} bt_save_t;

#endif // BT_FLAGS_H
