#ifndef TEMP_FLAGS_H
#define TEMP_FLAGS_H

typedef struct {
/* 0x00 */  u8 _unknown_0x00_7 : 1;
            u8 _unknown_0x00_6 : 1;
            u8 _unknown_0x00_5 : 1;
            u8 _unknown_0x00_4 : 1;
            u8 _unknown_0x00_3 : 1;
            u8 _unknown_0x00_2 : 1;
            u8 in_cutscene : 1;
            u8 _unknown_0x00_0 : 1;
/* 0x01 */  u8 _unknown_0x01_7 : 1;
            u8 _unknown_0x01_6 : 1;
            u8 _unknown_0x01_5 : 1;
            u8 _unknown_0x01_4 : 1;
            u8 _unknown_0x01_3 : 1;
            u8 _unknown_0x01_2 : 1;
            u8 _unknown_0x01_1 : 1;
            u8 _unknown_0x01_0 : 1;
/* 0x02 */  u8 _unknown_0x02_7 : 1;
            u8 _unknown_0x02_6 : 1;
            u8 _unknown_0x02_5 : 1;
            u8 _unknown_0x02_4 : 1;
            u8 _unknown_0x02_3 : 1;
            u8 _unknown_0x02_2 : 1;
            u8 _unknown_0x02_1 : 1;
            u8 _unknown_0x02_0 : 1;
/* 0x03 */  u8 _unknown_0x03_7 : 1;
            u8 _unknown_0x03_6 : 1;
            u8 _unknown_0x03_5 : 1;
            u8 _unknown_0x03_4 : 1;
            u8 _unknown_0x03_3 : 1;
            u8 _unknown_0x03_2 : 1;
            u8 _unknown_0x03_1 : 1;
            u8 _unknown_0x03_0 : 1;
/* 0x04 */  u8 _unknown_0x04_7 : 1;
            u8 _unknown_0x04_6 : 1;
            u8 _unknown_0x04_5 : 1;
            u8 _unknown_0x04_4 : 1;
            u8 _unknown_0x04_3 : 1;
            u8 _unknown_0x04_2 : 1;
            u8 _unknown_0x04_1 : 1;
            u8 _unknown_0x04_0 : 1;
/* 0x05 */  u8 _unknown_0x05_7 : 1;
            u8 _unknown_0x05_6 : 1;
            u8 _unknown_0x05_5 : 1;
            u8 _unknown_0x05_4 : 1;
            u8 _unknown_0x05_3 : 1;
            u8 train_cutscene_ww : 1;
            u8 train_cutscene_ggm : 1;
            u8 _unknown_0x05_0 : 1;
/* 0x06 */  u8 _unknown_0x06_7 : 1;
            u8 _unknown_0x06_6 : 1;
            u8 _unknown_0x06_5 : 1;
            u8 _unknown_0x06_4 : 1;
            u8 _unknown_0x06_3 : 1;
            u8 _unknown_0x06_2 : 1;
            u8 _unknown_0x06_1 : 1;
            u8 _unknown_0x06_0 : 1;
/* 0x07 */  u8 _unknown_0x07_7 : 1;
            u8 _unknown_0x07_6 : 1;
            u8 _unknown_0x07_5 : 1;
            u8 _unknown_0x07_4 : 1;
            u8 _unknown_0x07_3 : 1;
            u8 _unknown_0x07_2 : 1;
            u8 _unknown_0x07_1 : 1;
            u8 _unknown_0x07_0 : 1;
/* 0x08 */  u8 _unknown_0x08_7 : 1;
            u8 _unknown_0x08_6 : 1;
            u8 _unknown_0x08_5 : 1;
            u8 _unknown_0x08_4 : 1;
            u8 _unknown_0x08_3 : 1;
            u8 _unknown_0x08_2 : 1;
            u8 _unknown_0x08_1 : 1;
            u8 _unknown_0x08_0 : 1;
/* 0x09 */  u8 hag1_phase4_intro : 1;
            u8 hag1_phase3_intro : 1;
            u8 hag1_phase2_intro : 1;
            u8 hag1_quiz_incorrect : 1;
            u8 hag1_quiz_correct : 1;
            u8 hag1_breegull_blaster_intro : 1;
            u8 hag1_quiz_intro : 1;
            u8 hag1_phase1_intro : 1;
/* 0x0A */  u8 _unknown_0x0A_7 : 1;
            u8 _unknown_0x0A_6 : 1;
            u8 _unknown_0x0A_5 : 1;
            u8 hag1_phase8_intro : 1;
            u8 hag1_phase7_intro : 1;
            u8 hag1_phase6_intro : 1;
            u8 hag1_phase9_intro : 1;
            u8 hag1_phase5_intro : 1;
/* 0x0B */  u8 _unknown_0x0B_7 : 1;
            u8 _unknown_0x0B_6 : 1;
            u8 _unknown_0x0B_5 : 1;
            u8 _unknown_0x0B_4 : 1;
            u8 _unknown_0x0B_3 : 1;
            u8 _unknown_0x0B_2 : 1;
            u8 _unknown_0x0B_1 : 1;
            u8 _unknown_0x0B_0 : 1;
/* 0x0C */  u8 _unknown_0x0C_7 : 1;
            u8 _unknown_0x0C_6 : 1;
            u8 _unknown_0x0C_5 : 1; //
            u8 _unknown_0x0C_4 : 1;
            u8 _unknown_0x0C_3 : 1;
            u8 _unknown_0x0C_2 : 1;
            u8 _unknown_0x0C_1 : 1;
            u8 _unknown_0x0C_0 : 1;
/* 0x0D */  u8 _unknown_0x0D_7 : 1;
            u8 _unknown_0x0D_6 : 1;
            u8 level_recently_loaded : 1; // set on scene transistion, unset just before level label starts to fade
            u8 _unknown_0x0D_4 : 1;
            u8 _unknown_0x0D_3 : 1;
            u8 train_cutscene_tdl : 1;
            u8 train_cutscene_gi : 1;
            u8 _unknown_0x0D_0 : 1;
/* 0x0E */  u8 train_cutscene_unknown : 1;
            u8 _unknown_0x0E_6 : 1;
            u8 _unknown_0x0E_5 : 1; // set when in ggm?
            u8 _unknown_0x0E_4 : 1;
            u8 _unknown_0x0E_3 : 1;
            u8 _unknown_0x0E_2 : 1;
            u8 _unknown_0x0E_1 : 1;
            u8 _unknown_0x0E_0 : 1;
/* 0x0F */  u8 _unknown_0x0F_7 : 1;
            u8 _unknown_0x0F_6 : 1;
            u8 _unknown_0x0F_5 : 1;
            u8 train_cutscene_hfp_lava : 1;
            u8 train_cutscene_hfp_icy : 1;
            u8 _unknown_0x0F_2 : 1;
            u8 _unknown_0x0F_1 : 1;
            u8 _unknown_0x0F_0 : 1;
/* 0x10 */  u8 _unknown_0x10_7 : 1;
            u8 _unknown_0x10_6 : 1;
            u8 _unknown_0x10_5 : 1;
            u8 _unknown_0x10_4 : 1;
            u8 _unknown_0x10_3 : 1;
            u8 _unknown_0x10_2 : 1;
            u8 _unknown_0x10_1 : 1;
            u8 _unknown_0x10_0 : 1;
/* 0x11 */  u8 _unknown_0x11_7 : 1;
            u8 _unknown_0x11_6 : 1;
            u8 _unknown_0x11_5 : 1;
            u8 train_cutscene_ioh : 1;
            u8 _unknown_0x11_3 : 1; // set at the end of ggm canary mary race when winning. unset after transition
            u8 bubble_cutscene : 1; // for both ccl and ioh_wl
            u8 _unknown_0x11_1 : 1;
            u8 _unknown_0x11_0 : 1;
/* 0x12 */  u8 _unknown_0x12_7 : 1;
            u8 _unknown_0x12_6 : 1;
            u8 _unknown_0x12_5 : 1;
            u8 ccl_eyeballus_jiggium_plant_dialog : 1;
            u8 _unknown_0x12_3 : 1;
            u8 _unknown_0x12_2 : 1;
            u8 _unknown_0x12_1 : 1;
            u8 _unknown_0x12_0 : 1;
/* 0x13 */  u8 _unknown_0x13_7 : 1;
            u8 _unknown_0x13_6 : 1;
            u8 _unknown_0x13_5 : 1;
            u8 _unknown_0x13_4 : 1;
            u8 _unknown_0x13_3 : 1;
            u8 _unknown_0x13_2 : 1;
            u8 _unknown_0x13_1 : 1;
            u8 _unknown_0x13_0 : 1;
/* 0x14 */  u8 ww_test : 1;
            u8 _unknown_0x14_6 : 1;
            u8 _unknown_0x14_5 : 1;
            u8 _unknown_0x14_4 : 1;
            u8 _unknown_0x14_3 : 1;
            u8 _unknown_0x14_2 : 1;
            u8 _unknown_0x14_1 : 1;
            u8 _unknown_0x14_0 : 1;
/* 0x15 */  u8 _unknown_0x15_7 : 1;
            u8 _unknown_0x15_6 : 1;
            u8 _unknown_0x15_5 : 1;
            u8 ccl_eyeballus_jiggium_plant_cutscene : 1;
            u8 _unknown_0x15_3 : 1;
            u8 _unknown_0x15_2 : 1;
            u8 _unknown_0x15_1 : 1;
            u8 _unknown_0x15_0 : 1;
/* 0x16 */  u8 _unknown_0x16_7 : 1;
            u8 _unknown_0x16_6 : 1;
            u8 _unknown_0x16_5 : 1;
            u8 _unknown_0x16_4 : 1;
            u8 _unknown_0x16_3 : 1;
            u8 _unknown_0x16_2 : 1;
            u8 _unknown_0x16_1 : 1;
            u8 _unknown_0x16_0 : 1;
/* 0x17 */  u8 _unknown_0x17_7 : 1;
            u8 _unknown_0x17_6 : 1;
            u8 _unknown_0x17_5 : 1;
            u8 _unknown_0x17_4 : 1;
            u8 _unknown_0x17_3 : 1;
            u8 _unknown_0x17_2 : 1;
            u8 _unknown_0x17_1 : 1;
            u8 _unknown_0x17_0 : 1;
/* 0x18 */  u8 _unknown_0x18_7 : 1;
            u8 _unknown_0x18_6 : 1;
            u8 _unknown_0x18_5 : 1;
            u8 _unknown_0x18_4 : 1;
            u8 _unknown_0x18_3 : 1;
            u8 _unknown_0x18_2 : 1;
            u8 _unknown_0x18_1 : 1;
            u8 _unknown_0x18_0 : 1;
/* 0x19 */  u8 _unknown_0x19_7 : 1;
            u8 _unknown_0x19_6 : 1;
            u8 _unknown_0x19_5 : 1;
            u8 _unknown_0x19_4 : 1;
            u8 _unknown_0x19_3 : 1;
            u8 _unknown_0x19_2 : 1;
            u8 _unknown_0x19_1 : 1;
            u8 _unknown_0x19_0 : 1;
/* 0x1A */  u8 _unknown_0x1A_7 : 1;
            u8 _unknown_0x1A_6 : 1;
            u8 _unknown_0x1A_5 : 1;
            u8 _unknown_0x1A_4 : 1;
            u8 _unknown_0x1A_3 : 1;
            u8 _unknown_0x1A_2 : 1;
            u8 _unknown_0x1A_1 : 1;
            u8 _unknown_0x1A_0 : 1;
/* 0x1B */  u8 _unknown_0x1B_7 : 1;
            u8 _unknown_0x1B_6 : 1;
            u8 _unknown_0x1B_5 : 1;
            u8 _unknown_0x1B_4 : 1;
            u8 _unknown_0x1B_3 : 1;
            u8 _unknown_0x1B_2 : 1;
            u8 _unknown_0x1B_1 : 1;
            u8 _unknown_0x1B_0 : 1;
/* 0x1C */  u8 _unknown_0x1C_7 : 1;
            u8 _unknown_0x1C_6 : 1;
            u8 _unknown_0x1C_5 : 1;
            u8 _unknown_0x1C_4 : 1;
            u8 _unknown_0x1C_3 : 1;
            u8 _unknown_0x1C_2 : 1;
            u8 _unknown_0x1C_1 : 1;
            u8 _unknown_0x1C_0 : 1;
/* 0x1D */  u8 _unknown_0x1D_7 : 1;
            u8 _unknown_0x1D_6 : 1;
            u8 _unknown_0x1D_5 : 1;
            u8 _unknown_0x1D_4 : 1;
            u8 _unknown_0x1D_3 : 1;
            u8 _unknown_0x1D_2 : 1;
            u8 _unknown_0x1D_1 : 1;
            u8 _unknown_0x1D_0 : 1;
/* 0x1E */  u8 _unknown_0x1E_7 : 1;
            u8 _unknown_0x1E_6 : 1;
            u8 _unknown_0x1E_5 : 1;
            u8 _unknown_0x1E_4 : 1;
            u8 _unknown_0x1E_3 : 1;
            u8 _unknown_0x1E_2 : 1;
            u8 _unknown_0x1E_1 : 1;
            u8 _unknown_0x1E_0 : 1;
/* 0x1F */  u8 _unknown_0x1F_7 : 1;
            u8 _unknown_0x1F_6 : 1;
            u8 _unknown_0x1F_5 : 1;
            u8 _unknown_0x1F_4 : 1;
            u8 _unknown_0x1F_3 : 1;
            u8 _unknown_0x1F_2 : 1;
            u8 _unknown_0x1F_1 : 1;
            u8 _unknown_0x1F_0 : 1;
} bt_save_temp_flags_t;

#endif // TEMP_FLAGS_H
